GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
static void IRAM_ATTR l2_log_stage(const char *name, size_t nlen, uint16_t qtype,
                                   uint32_t client_ip_hbo, bool blocked)
{
    uint32_t head = s_l2log_head.load(std::memory_order_relaxed);
    uint32_t tail = s_l2log_tail.load(std::memory_order_acquire);
    /* Ring full: drop and count, never block or overwrite — the L2 hook must
     * never stall waiting on dns_task. A nonzero l2_log_dropped means a burst
     * outran the ~100ms drain rate for that window, not a bug; which specific
     * queries were lost isn't recorded, only the count. */
    if (head - tail >= L2LOG_RING) {
        s_l2log_dropped.fetch_add(1, std::memory_order_relaxed);
        return;
    }
    L2LogEntry *e = &s_l2log[head % L2LOG_RING];
    size_t cl = nlen < sizeof(e->domain) - 1 ? nlen : sizeof(e->domain) - 1;
    memcpy(e->domain, name, cl);
    e->domain[cl] = '\0';
    e->client_ip = client_ip_hbo;
    e->qtype = qtype;
    e->blocked = blocked;
    s_l2log_head.store(head + 1, std::memory_order_release);
}

/* Consumer, called from dns_task: pulls one staged entry, if any. Returns
 * false when the ring is empty. Not IRAM_ATTR — dns_task isn't flash-
 * constrained the way the L2 hook is. */
extern "C" bool dns_sink_l2log_drain(char *domain_out, size_t domain_cap,
                                     uint16_t *qtype_out, uint32_t *client_ip_out,
                                     bool *blocked_out)
{
    uint32_t tail = s_l2log_tail.load(std::memory_order_relaxed);
    uint32_t head = s_l2log_head.load(std::memory_order_acquire);
    if (tail == head) return false;
    L2LogEntry *e = &s_l2log[tail % L2LOG_RING];
    size_t cl = strnlen(e->domain, sizeof(e->domain));
    if (cl >= domain_cap) cl = domain_cap - 1;
    memcpy(domain_out, e->domain, cl);
    domain_out[cl] = '\0';
    *qtype_out = e->qtype;
    *client_ip_out = e->client_ip;
    *blocked_out = e->blocked;
    s_l2log_tail.store(tail + 1, std::memory_order_release);
    return true;
}
extern "C" uint32_t dns_sink_l2log_dropped(void) { return s_l2log_dropped.load(std::memory_order_relaxed); }
#else  /* !CONFIG_ADBLOCK_NET_ETH — no L2 hook, so no producer ever stages anything */
extern "C" bool dns_sink_l2log_drain(char *, size_t, uint16_t *, uint32_t *, bool *) { return false; }
extern "C" uint32_t dns_sink_l2log_dropped(void) { return 0; }
#endif /* CONFIG_ADBLOCK_NET_ETH — L2 query-log staging ring */

/* ── Passive L2 census staging ring (#73 foundation) ─────────────────
 * Pi-hole/AGH cannot see any of this without being the DHCP server; this
 * hook already sees every broadcast frame on the wire, DHCP included, which
 * is the capability gap this issue exists to close.
 *
 * Same shape as the query-log ring just above, for the same reason: a
 * lock-free SPSC ring in internal RAM, IRAM_ATTR producer, drained by
 * dns_task (not IRAM-constrained) into the real, PSRAM-resident census
 * table. A sighting is not a verdict — it answers nothing and must never
 * block the eth RX task, so a full ring drops and counts exactly like the
 * query log's.
 *
 * Two producer call sites, both in l2_input_cb below:
 *   1. l2_census_frame(), called as literally the FIRST statement, before
 *      any of that function's own checks. ARP's ethertype (0x0806) fails
 *      l2_input_cb's very first check (IPv4 only); DHCP's destination port
 *      (67, not 53) fails deep in its ladder. Neither frame kind would ever
 *      reach anything that records client identity otherwise — a census
 *      sighting is deliberately NOT gated behind checks that exist to decide
 *      whether this hook may safely ANSWER a query, because a sighting
 *      answers nothing.
 *   2. A one-line census_stage(..., CENSUS_SEEN_QUERY, ...) call once l2_qname
 *      has confirmed a well-formed A/AAAA/IN question — this is the "did
 *      this MAC ever ask us anything" half of bypass-by-absence, and it
 *      falls out of state the ladder already computed (src MAC, src IP),
 *      so it costs nothing new to gather.
 *
 * mDNS/SSDP are NOT parsed by this producer. The W5500's multicast-block bit
 * being open for them was checked empirically (a raw mDNS A-record query sent
 * to 224.0.0.251:5353, board-filtered to rule out a same-subnet false
 * positive, got a matching reply from both `.195` and `.244`'s own IP), so
 * the door is open for a follow-up, but this foundation doesn't rely on it:
 * ARP and DHCP DISCOVER/REQUEST are broadcast, not multicast, and the hook
 * already proves it sees those (they're what moves l2_fallthrough on an idle
 * board with queries_total still 0).
 *
 * Guarded under CONFIG_ADBLOCK_NET_ETH for the same #3a reason as the query
 * log: this ring is internal .bss on a board that may have no L2 hook to
 * feed it at all. */
#if CONFIG_ADBLOCK_NET_ETH
#define CENSUS_RING 32
/* kind is one of census.h's CENSUS_SEEN_* constants — shared with the
 * consumer via that header rather than a second, comment-synced enum here,
 * so the two sides can't drift silently. */
typedef struct {
    uint8_t  mac[6];
    uint32_t ip;            /* host byte order; 0 if this event carries none */
    int      kind;
    char     hostname[32];  /* DHCP option 12 value; empty for ARP/QUERY */
} CensusEvent;
static CensusEvent           s_census_ring[CENSUS_RING];
static std::atomic<uint32_t> s_census_head{0};    /* producer-owned (eth RX task) */
static std::atomic<uint32_t> s_census_tail{0};    /* consumer-owned (dns_task) */
static std::atomic<uint32_t> s_census_dropped{0}; /* producer increments, httpd task reads */

static void IRAM_ATTR census_stage(const uint8_t *mac, uint32_t ip, int kind,
                                   const char *hostname, size_t hostname_len)
{
    uint32_t head = s_census_head.load(std::memory_order_relaxed);
    uint32_t tail = s_census_tail.load(std::memory_order_acquire);
    if (head - tail >= CENSUS_RING) {
        s_census_dropped.fetch_add(1, std::memory_order_relaxed);
        return;
    }
    CensusEvent *e = &s_census_ring[head % CENSUS_RING];
    memcpy(e->mac, mac, 6);
    e->ip = ip;
    e->kind = kind;
    census_copy_hostname(e->hostname, hostname, hostname_len);
    s_census_head.store(head + 1, std::memory_order_release);
}

/* Frame-level producer (call site 1 of 2) — classifies ARP and DHCP client
 * messages and stages a sighting. See the block comment above for why this
 * runs before, and independent of, l2_input_cb's own verdict-path checks. */
static void IRAM_ATTR l2_census_frame(const uint8_t *buf, uint32_t len)
{
    if (len < 14 + 2) return;
    const uint8_t *mac = buf + 6;   /* Ethernet source address */

