GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    if (buf[12] == 0x08 && buf[13] == 0x06) {            /* ARP */
        if (len < 14 + 28) return;                        /* full IPv4-over-Ethernet ARP payload */
        if (buf[14 + 4] != 6 || buf[14 + 5] != 4) return;  /* hwlen=6, prolen=4 only */
        uint32_t spa = ((uint32_t)buf[28] << 24) | ((uint32_t)buf[29] << 16) |
                       ((uint32_t)buf[30] << 8)  |  (uint32_t)buf[31];
        if (spa == 0) return;   /* ARP probe (RFC 5227): sender has no IP yet */
        census_stage(mac, spa, CENSUS_SEEN_ARP, nullptr, 0);
        return;
    }

    if (buf[12] != 0x08 || buf[13] != 0x00) return;   /* IPv4 only below this point */
    if (len < 14 + 20) return;
    if ((buf[14] >> 4) != 4) return;
    int ihl = (buf[14] & 0x0F) * 4;
    if (ihl < 20 || 14 + (uint32_t)ihl + 8 > len) return;
    /* (#106) Length comes from the IP header, never from the frame — Ethernet
     * pads short frames to 60 bytes, so a UDP length that fits within the raw
     * `len` budget can still extend into that padding and get parsed as DHCP
     * option TLVs (including option 12, the hostname). Same cross-check
     * l2_input_cb makes against its own `iptot`. */
    int iptot = (buf[16] << 8) | buf[17];
    if (iptot < ihl + 8 || 14 + iptot > (int)len) return;
    /* A non-first fragment carries no UDP header at this offset at all — the
     * bytes below would be raw payload continuation, not sport/dport, and
     * could coincidentally read as 68/67 and stage a garbage DHCP sighting
     * with a garbage hostname. Same check l2_input_cb makes at buf[20:21]. */
    if (((buf[20] << 8) | buf[21]) & 0x3FFF) return;
    if (buf[14 + 9] != 17) return;                    /* UDP only */
    int udp = 14 + ihl;
    uint16_t sport = (buf[udp] << 8) | buf[udp + 1];
    uint16_t dport = (buf[udp + 2] << 8) | buf[udp + 3];
    if (sport != 68 || dport != 67) return;           /* DHCP client -> server only */
    int udplen = (buf[udp + 4] << 8) | buf[udp + 5];
    if (udplen < 8 + 240 || udp + udplen > 14 + iptot) return;
    const uint8_t *dhcp = buf + udp + 8;
    uint32_t dhcp_len = (uint32_t)udplen - 8;
    /* BOOTP fixed header is 236 bytes (RFC 951/2131), then a 4-byte magic
     * cookie (99.130.83.99), then options as TLV. ciaddr (offset 12) is
     * usually 0 pre-lease, so this doesn't gate on it — a DISCOVER with no
     * address yet is still a sighting worth having. */
    if (dhcp_len < 240 || dhcp[236] != 99 || dhcp[237] != 130 ||
        dhcp[238] != 83 || dhcp[239] != 99) return;
    uint32_t off = 240;
    const char *hostname = nullptr; size_t hostname_len = 0;
    /* Bounded TLV scan, capped at 64 iterations regardless of how many
     * options the frame carries — this is IRAM-resident and must never spin
     * on a malformed or adversarial packet. */
    for (int iter = 0; iter < 64 && off < dhcp_len; iter++) {
        uint8_t opt = dhcp[off];
        if (opt == 0xFF) break;                 /* end option */
        if (opt == 0x00) { off += 1; continue; } /* pad */
        if (off + 1 >= dhcp_len) break;
        uint8_t olen = dhcp[off + 1];
        if (off + 2 + olen > dhcp_len) break;    /* truncated option — stop, don't guess */
        if (opt == 12 && olen > 0) {             /* option 12: host name */
            hostname = (const char *)&dhcp[off + 2];
            hostname_len = olen;
        }
        off += 2 + olen;
    }
    census_stage(mac, 0, CENSUS_SEEN_DHCP, hostname, hostname_len);
}

/* Consumer, called from dns_task: pulls one staged event, if any. Returns
 * false when the ring is empty. Not IRAM_ATTR — dns_task isn't flash-
 * constrained the way the L2 hook is. */
extern "C" bool dns_sink_census_drain(uint8_t mac_out[6], uint32_t *ip_out,
                                      int *kind_out, char *hostname_out, size_t hostname_cap)
{
    uint32_t tail = s_census_tail.load(std::memory_order_relaxed);
    uint32_t head = s_census_head.load(std::memory_order_acquire);
    if (tail == head) return false;
    CensusEvent *e = &s_census_ring[tail % CENSUS_RING];
    memcpy(mac_out, e->mac, 6);
    *ip_out = e->ip;
    *kind_out = (int)e->kind;
    if (hostname_cap > 0) {   /* 0 means the caller wants no hostname — nothing to write */
        size_t cl = strnlen(e->hostname, sizeof(e->hostname));
        if (cl >= hostname_cap) cl = hostname_cap - 1;
        memcpy(hostname_out, e->hostname, cl);
        hostname_out[cl] = '\0';
    }
    s_census_tail.store(tail + 1, std::memory_order_release);
    return true;
}
extern "C" uint32_t dns_sink_census_dropped(void) { return s_census_dropped.load(std::memory_order_relaxed); }
#else  /* !CONFIG_ADBLOCK_NET_ETH — no L2 hook, so no producer ever stages anything */
extern "C" bool dns_sink_census_drain(uint8_t[6], uint32_t *, int *, char *, size_t) { return false; }
extern "C" uint32_t dns_sink_census_dropped(void) { return 0; }
#endif /* CONFIG_ADBLOCK_NET_ETH — passive L2 census staging ring */

/* (#109) The question-qname parser that used to live here (l2_qname) is now
 * dns_extract_qname() in domain.c/.h, shared with dns_server.cpp's socket
 * path — the two copies' bounds checks had already drifted (functionally
 * equivalent, but only by accident) since #42/L5 needed a human to notice
 * and mirror a fix by hand. It stays IRAM_ATTR there for this call site.
 *
 * IRAM_ATTR (#78): makes the "never touch flash from the L2 hook" invariant
 * explicit rather than relying on CONFIG_LWIP_IRAM_OPTIMIZATION to have
 * caught it incidentally — that setting only covers lwIP's own component
 * sources, not this callback, which esp_eth invokes via a stored function
 * pointer (so it can't be inlined into anything already in IRAM). */
#if CONFIG_ADBLOCK_NET_ETH

/* (#109) Shared tail for both l2_input_cb reply paths (cache hit, blocked).
 * Both build their DNS payload directly into tx[dns..], at which point what
 * remains is identical: turn the copied request's Ethernet/IP/UDP headers
 * into a reply addressed back to the sender, patch the two length fields for
 * this payload's size, and redo the IP checksum (zeroed UDP checksum is
 * legal for IPv4 either way).
 *
 * Deliberately does NOT touch the DNS txid: the blocked path's payload was
 * memcpy'd from the original query (buf), so its txid is already correct;
 * the cached path's payload came from the forward cache and needs its own
 * one-line patch (tx[dns]=buf[dns]; tx[dns+1]=buf[dns+1];) BEFORE calling
 * this — folding that in here would mean every future caller either gets an
 * unwanted patch or has to know to undo it. Keeping it caller-side makes the
 * one real hazard in this consolidation (patch the wrong reply's txid, or
 * silently drop the patch) impossible to get wrong by construction. */
static void IRAM_ATTR l2_finish_reply(uint8_t *tx, int ihl, int udp, int payload_len)
{
    uint8_t t6[6];
    memcpy(t6, tx, 6); memcpy(tx, tx + 6, 6); memcpy(tx + 6, t6, 6);              /* swap MAC */
    uint8_t t4[4];
    memcpy(t4, tx+14+12, 4); memcpy(tx+14+12, tx+14+16, 4); memcpy(tx+14+16, t4, 4); /* swap IP */
    uint8_t t2[2];
    memcpy(t2, tx+udp, 2); memcpy(tx+udp, tx+udp+2, 2); memcpy(tx+udp+2, t2, 2);     /* swap ports */
    int iptot = ihl + 8 + payload_len;
    tx[14+2] = (iptot >> 8); tx[14+3] = (iptot & 0xFF);
    int udplen = 8 + payload_len;
    tx[udp+4] = (udplen >> 8); tx[udp+5] = (udplen & 0xFF);
    tx[udp+6] = 0; tx[udp+7] = 0;                     /* zero UDP checksum (legal IPv4) */
    tx[14+10] = 0; tx[14+11] = 0;                     /* IP checksum */
    uint32_t sum = 0;
    for (int i = 0; i < ihl; i += 2) sum += (tx[14+i] << 8) | tx[14+i+1];
    while (sum >> 16) sum = (sum & 0xFFFF) + (sum >> 16);
    uint16_t csum = ~sum;
    tx[14+10] = (csum >> 8); tx[14+11] = (csum & 0xFF);
}

static esp_err_t IRAM_ATTR l2_input_cb(esp_eth_handle_t h, uint8_t *buf, uint32_t len,
                             void *priv, void *info)
{
    (void)info;
    static uint8_t  tx[600];
    static char     name[256];
    bool query_confirmed = false;   /* (#128) set true once this is known to be
                                      * a genuine, well-formed DNS query — see
                                      * s_l2_dns_fallthrough's comment above. */
    /* #73: runs unconditionally, before any of the classification below.
     * A census sighting is not a verdict — it never answers anything, so it
     * must not be gated behind checks that exist to decide whether THIS hook
     * may safely answer a DNS query. ARP and DHCP frames fail those checks
     * immediately (wrong ethertype / wrong dst port) and would never reach
     * anything that records client identity otherwise. */
    l2_census_frame(buf, len);
    do {
        /* Every `break` below hands the frame to lwIP unchanged, which is what
         * keeps this hook honest about the two-verdict-path rule: it may only
         * answer a query it can classify exactly as the socket path would, and
         * anything it cannot classify — a header it will not vouch for, a lock
         * it cannot take, a rewrite it must not render — falls through to the
         * socket path rather than being answered on a guess or dropped here. */
        uint32_t our_ip = s_eth_ip_nbo.load(std::memory_order_relaxed);
        if (!our_ip) break;                              /* (#106) no address yet */
        if (len < 14 + 20 + 8 + 13) break;               /* min IPv4/UDP/DNS */
        if (buf[12] != 0x08 || buf[13] != 0x00) break;   /* IPv4 only */
        if ((buf[14] >> 4) != 4) break;                  /* (#106) IP version nibble */
        int ihl = (buf[14] & 0x0F) * 4;
        if (ihl < 20 || buf[14 + 9] != 17) break;        /* UDP only */
        /* (#106) Length comes from the IP header, never from the frame: Ethernet
         * pads short frames to 60 bytes, so `len - dns` counted padding as DNS
         * payload, and an IP total-length larger than the frame was never
         * rejected at all. */
        int iptot = (buf[16] << 8) | buf[17];
        if (iptot < ihl + 8 || 14 + iptot > (int)len) break;
        /* (#106) Fragments: MF set or a non-zero offset means this frame is not
         * a whole datagram, so the bytes at the UDP/DNS offsets are not what
         * they look like. Reassembly is lwIP's job. */
        if (((buf[20] << 8) | buf[21]) & 0x3FFF) break;
        /* (#106) Only answer what is addressed to us. Without this the hook
         * replied to a query sent to the subnet broadcast — and, since it just
         * swaps the addresses back, replied FROM the broadcast address TO
         * whatever the source claimed to be. */
        uint32_t dst_ip;
        memcpy(&dst_ip, buf + 14 + 16, 4);
        if (dst_ip != our_ip) break;
        /* (#106) A source that cannot receive a unicast reply (0.0.0.0, the
         * all-ones broadcast, or 224/4 multicast) is not a client. */
        uint32_t src_hbo = ((uint32_t)buf[26] << 24) | ((uint32_t)buf[27] << 16) |
                           ((uint32_t)buf[28] << 8)  |  (uint32_t)buf[29];
        if (src_hbo == 0 || src_hbo == 0xFFFFFFFFu || (buf[26] & 0xF0) == 0xE0) break;
        /* (#73/#128, moved here on review) Recognize "this is a genuine,
         * well-formed, single-question DNS query" BEFORE the ACL/pause/bypass
         * gates below. Those gates decide whether THIS hook may ANSWER —
         * they say nothing about whether a frame counts as a query. Staging
         * the census sighting and setting query_confirmed only AFTER those
         * gates (their original position) meant an ACL-denied, paused, or
         * bypassed client's ordinary DNS queries never reached this code at
         * all: the ladder above already `break`s for them one line earlier.
         * That produced a false "suspected bypass" flag for exactly the
         * clients an admin explicitly allowed or paused — the category
         * least likely to actually be bypassing this resolver — and made
         * #128's dns_fallthrough undercount real demand from the same
         * clients. `udp`/`dns`/`dns_len` computed here are reused unchanged
         * by the answer-path code below; nothing about which frames end up
         * answered vs. deferred changes — only when a sighting is staged. */
        int udp = 14 + ihl;
        if (((buf[udp + 2] << 8) | buf[udp + 3]) != 53) break;   /* dst port 53 */
        int udplen = (buf[udp + 4] << 8) | buf[udp + 5];         /* (#106) */
        if (udplen < 8 + 12 || udp + udplen > 14 + iptot) break;
        int dns = udp + 8, dns_len = udplen - 8;
        if (buf[dns + 2] & 0x80) break;                  /* must be a query (QR=0) */
        if (((buf[dns + 4] << 8) | buf[dns + 5]) != 1) break;    /* qdcount==1 */
        /* (#128) Reached only for a genuine, well-formed, single-question DNS
         * query — everything that falls through from here on is real DNS
         * demand, not link noise. See s_l2_dns_fallthrough's comment. */
        query_confirmed = true;
        /* #73 (call site 2 of 2): this MAC has now sent us a well-formed
         * single-question DNS query — the "queried us" half of
         * bypass-by-absence. Staged here, before the A/AAAA/IN narrowing
         * further below (which exists to decide whether THIS hook may
         * answer, not whether a question counts as a sighting) AND before
         * the ACL/pause/bypass gates immediately below (which exist to
         * decide whether this hook may answer AT ALL, same reasoning). A
         * client that only ever sends PTR/TXT/type-65 queries, or one under
         * an admin pause/bypass/ACL rule, is not silent — staging after
         * either kind of gate would have missed it and produced a false
         * "suspected bypass". */
        census_stage(buf + 6, src_hbo, CENSUS_SEEN_QUERY, nullptr, 0);
        /* (#87) The ACL guards the socket path but never this one, so a client
         * excluded from DNS still got blocked verdicts and cached answers over
         * Ethernet — the fast path only failed to answer on a cold miss, where
         * it fell through to the ACL-protected socket. Provable permission is
         * required to answer here; denied OR unknown defers to that socket,
         * which drops the query if it really is denied. */
        if (!acl_permits_nb(src_hbo)) break;
        /* (#48/#74) A client under a timed pause, or on the standing bypass
         * list, must get the real answer, which only the socket path can
         * fetch. Deferring here (rather than answering "not blocked") keeps
         * this hook's rule intact: it never forwards, and it never answers
         * on a verdict the socket path would override. The socket path
         * re-derives both from the same tables. */
        if (pause_active_for(src_hbo) || bypass_active_for_nb(src_hbo)) break;
        size_t nlen = 0;
        int qend = dns_extract_qname(buf + dns, dns_len, 12, name, sizeof(name), &nlen);
        if (qend < 0) break;
        uint16_t qtype = (buf[dns + qend - 4] << 8) | buf[dns + qend - 3];
        if (qtype != 1 && qtype != 28) break;            /* A / AAAA only */
        uint16_t qclass = (buf[dns + qend - 2] << 8) | buf[dns + qend - 1];
        if (qclass != 1) break;                          /* (#106) class IN only */
        /* (#102) The socket path consults the rewrite table before the
         * blocklist, so a name that is both rewritten and blocklisted answers
         * with the configured address there — while this path went straight to
         * the blocklist and answered 0.0.0.0, making the verdict depend on
         * which transport the client happened to use. Test the same table here
         * and, on a match, defer: the answer is then built by the one
         * build_rewrite_a() in the socket path instead of a second copy in
         * IRAM. `-1` (table busy) defers too — same fail-to-the-slow-path rule
         * as everywhere else in this hook. */
        if (qtype == 1) {
            uint32_t rw = 0;
            if (rewrite_lookup_nb(name, nlen, &rw) != 0) break;
        }
        if (!blocklist_is_blocked_nb(name, nlen)) {      /* not blocked → try L2 cache, else lwIP */
            /* Forward-cache hit answered straight from L2, skipping lwIP — the
             * same socket-stack overhead the blocked path already bypasses. Lay
             * the eth+ip+udp headers into tx, then the seqlock-protected reader
             * copies the cached DNS reply right after them. Miss/race → lwIP. */
            int clen = dns_cache_l2_get(domain_hash(name, nlen), qtype,
                                        tx + dns, (int)sizeof(tx) - dns);
            if (clen <= 0) break;                        /* miss/expired/race → lwIP */
            memcpy(tx, buf, dns);                         /* eth+ip+udp headers */
            tx[dns] = buf[dns]; tx[dns+1] = buf[dns+1];   /* patch txid to this query */
            l2_finish_reply(tx, ihl, udp, clen);
            if (esp_eth_transmit(h, tx, dns + clen) != ESP_OK) s_l2_tx_fail++;
            s_l2_cached++;
            l2_log_stage(name, nlen, qtype, src_hbo, false);
            free(buf);                                    /* consumed (== eth_l2_free) */
            return ESP_OK;
        }

        /* ── craft blocked response in tx ── */
        int rdlen = (qtype == 28) ? 16 : 4;
        int dns_resp = qend + 12 + rdlen;                /* question + answer RR */
        int frame = dns + dns_resp;
        if (frame > (int)sizeof(tx)) break;
        memcpy(tx, buf, dns + qend);                     /* eth+ip+udp+dns(hdr+question) */
        { uint16_t qf = (buf[dns+2] << 8) | buf[dns+3];
          uint16_t rf = dns_resp_flags(qf, 0);
          tx[dns+2] = (rf >> 8); tx[dns+3] = (rf & 0xFF); }
        tx[dns+6] = 0; tx[dns+7] = 1;                    /* ancount=1 */
        tx[dns+8] = 0; tx[dns+9] = 0; tx[dns+10] = 0; tx[dns+11] = 0;  /* ns/ar=0 */
        uint8_t *a = tx + dns + qend;
        a[0]=0xC0; a[1]=0x0C; a[2]=(qtype>>8); a[3]=(qtype&0xFF);
        /* (#109) TTL shared with the socket path's BLOCKED_TTL_S (dns_server.h)
         * rather than a second hardcoded literal — the two verdict paths must
         * agree on how long a client caches a block, not just whether. */
        a[4]=0; a[5]=1;                                              /* class IN */
        a[6]=(BLOCKED_TTL_S>>24)&0xFF; a[7]=(BLOCKED_TTL_S>>16)&0xFF;
        a[8]=(BLOCKED_TTL_S>>8)&0xFF;  a[9]=BLOCKED_TTL_S&0xFF;      /* ttl */
        a[10]=(rdlen>>8); a[11]=(rdlen&0xFF);
        memset(a+12, 0, rdlen);                          /* 0.0.0.0 / :: */
        l2_finish_reply(tx, ihl, udp, dns_resp);

        if (esp_eth_transmit(h, tx, frame) != ESP_OK) s_l2_tx_fail++;
        s_l2_blocked++;
        l2_log_stage(name, nlen, qtype, src_hbo, true);
        free(buf);                                       /* we consumed it (== eth_l2_free) */
        return ESP_OK;
    } while (0);

